<template>
  <div class="">
    <div class="article">
      <div class='banner'>
        <span class='title'>
          恒盈课堂
        </span>
        <img src="../assets/article/banner.jpg" alt="">
      </div>
    </div>
    <ul class='article-list'>
      <li>
        <h2 class='article-name'>{{article.title}}</h2>
        <div class='article-img' v-for="(img, index) in article.imgUrl">
          <p>{{article.descr[index]}}</p>
          <div class="img-wrap">
            <img v-lazy="img" alt="article.title">
          </div>
        </div>
        <div class='article-img' v-for='item in articlLeft'>
          <p>{{item}}</p>
        </div>
       </li>
    </ul>
  </div>
</template>

<script>
var articleStorage = [{
  title: '10款儿童房设计 总有一款适合你家宝贝',
  descr: ['1.孩子的房间，除了环保、安全以外，梦幻、色彩斑斓应该就是最重要的了，有趣的、卡通的、炫酷的都是孩子们的最爱。因此，充满童趣，创意十足的儿童房绝对是必须的，融发装饰整理了10款个性儿童房的案例，您可借鉴一下，为自己的孩子打造一个梦幻天地。高低床，上方为床，下方可是孩子躲猫猫的好去处。还有炫酷的滑梯，孩子早上起床时是不是不再懒床了?',
  '2.屋顶以具有层次感的彩色天花，让这间儿童房整体感觉显得赋有别具一格的设计感，床边墙面上树枝造型的储物架则让这间儿童房显得童趣十足，沿着窗边简易的书架设计既美观实用，也不会占据太多空间，在房间内铺上柔软的地毯便能够让孩子在这间房间里自由玩耍咯。',
  '3.淡紫色的墙面让这间儿童房空间中充满了淡淡的优雅气质，很适合给女孩子。大面的窗户给予这间儿童房足够的自然采光，精致的吊灯则体现出女孩房独有的优雅气质。',
  '4.以线和面结合打造出的儿童房墙面，加上原木色材质的沙发，搭配上饱和色系的抱枕以及个性的软座，让这间儿童房看起来舒适无比，相信不仅孩子会喜欢，大人也会爱上它吧。',
  '5.香蕉黄色的墙面与粉色家具作搭配，再加上天蓝色系的地毯，整个粉粉的调子让空间显得童趣可爱，女孩子一定会喜欢。',
  '6.天蓝色系的墙面上排列组合了许多形状各异的相框和装饰画，跳跃的颜色让这间儿童房的背景墙显得活力四射，柠檬黄色的儿童床在墙面颜色的衬托下让整间儿童房都显出明朗的氛围。',
  '7.宽敞的空间、整洁又收纳性极强的木柜、将收纳隐于无形的多彩床帘。各种颜色相互融合碰撞，给人以强烈的视觉冲击力。',
  '8.橙白相间的波浪地毯、色彩浓烈的世界地图墙纸、原木色的儿童床和深色抱枕，无一不是在增添儿童所需所爱的童趣，同时也让亮色去提亮空间，避免空间的暗沉。',
  '9.除了明亮的颜色以外，一款非常有创意的鸟笼吊灯点亮了整个空间，给孩子无限遐想。',
  '10.背景墙和被褥丰富的颜色大大地刺激了视觉感官，色彩的跳跃感和层次感有效地活跃了空间氛围，炫酷的感觉大儿童也会喜欢吧!'
  ],
  imgUrl: [require('../assets/article/article-1-1.jpg'), require('../assets/article/article-1-2.jpg'), require('../assets/article/article-1-3.jpg'), require('../assets/article/article-1-4.jpg'), require('../assets/article/article-1-5.jpg'), require('../assets/article/article-1-6.jpg'), require('../assets/article/article-1-7.jpg'), require('../assets/article/article-1-8.jpg'), require('../assets/article/article-1-9.jpg'), require('../assets/article/article-1-10.jpg')]
}, {
  title: '四种办公室地毯材质的优缺点',
  descr: ['1.现在很多中小型公司在办公室装修的时候选择地毯，它有很多其他材质无法比拟的优点。它的防滑防尘“静音”效果，很好的吸收了高跟鞋的噔噔声。办公室地毯也有很多类型，不同类型有各自的优缺点，今天我们就来聊一聊办公室装修知识，方便您日后更好的挑选办公室地毯。',
  '2.塑料地毯由聚氯乙烯树脂等材料制成,虽然质地较薄、手感硬、受气温的影响大,易老化，但该种材料色彩鲜艳、耐湿性、耐腐蚀性、耐虫蛀性及可擦洗性都比其他材质有很大的提高,特别是具有阻燃性和价格低廉的优势,在办公楼装修中多用于门厅、玄关及卫生间入口等地点',
  '3.化纤地毯也称为合成纤维地毯,是以锦纶、丙纶、晴纶、涤纶等化学纤维为原料,用簇绒法或机织法加工成纤维面层,再与麻布底缝合成地毯。其质地、视感都近似于羊毛,耐磨而富有弹性;鲜艳的色彩、丰富的图案都不亚于纯毛。具有防燃、防污、防虫蛀的特点,清洗维护都很方便,在一般中档写字楼装修中使用日益广泛',
  '4.纯毛地毯的手感柔和,拉力大,弹性好,图案优美,色彩鲜艳,质地厚实,脚感舒适,并具有抗静电性能好、不易老化、不褪色等特点,是高档的地面装饰材料,也是高档装修中地面装饰的主要材料。但纯毛地毯的耐菌性、耐虫蛀性和耐潮湿性较差,价格昂贵,多用于高级别墅住宅的客厅、卧室等处',
  '5.混纺地毯是在纯毛纤维中加入一定比例的化学纤维制成,该种地毯在图案花色、质地手感等方面与纯毛地毯差别不大,但却克服了纯毛地毯不耐虫蛀、易腐蚀、易霉变的缺点,同时提高了地毯的耐磨性能,大大降低了地毯的价格,使用的范围广泛,在高档办公楼中最受欢迎'
  ],
  imgUrl: [require('../assets/article/article-2-1.jpg'), require('../assets/article/article-2-2.jpg')]
}, {
  title: '装修设计中最属简约设计风格有韵味',
  descr: ['1.客厅以米黄色为主，地面铺设瓷砖，墙面没有过于复杂造型，主要以流线型作为主体电视背景墙石膏板拉槽简单大方 餐厅简单布置，突出实用性，墙面简单挂画，色彩明亮。',
  '2.客厅以米黄色为主，地面铺设瓷砖，墙面没有过于复杂造型，主要以流线型作为主体，电视背景墙石膏板拉槽简单大方',
  '3.餐厅简单布置，突出实用性，墙面简单挂画，色彩明亮。',
  '4.主卧室以实用性为主，色彩明快，床头背景突显主人时尚大气风格',
  '5.小卧室以实用性为主，由于空间限制，建议客户做榻榻米，增大空间储物，并且卧室活动空间也增大',
  '6.感觉怎么样呢，看着有欧式的感觉，从中带一点现代，不伤大中华文明。'
  ],
  imgUrl: [require('../assets/article/article-3-1.jpg'), require('../assets/article/article-3-2.jpg'), require('../assets/article/article-3-3.jpg'), require('../assets/article/article-3-4.jpg'), require('../assets/article/article-3-5.jpg')]
}, {
  title: '办公室地毯的选择及日常维护',
  descr: ['1.办公区域是公司员工工作的场所，所选用地毯要求质地紧密，绒毛不宜过高，方便办公椅的挪动。例如：价格，颜色，材质，以及是否环保。现代办公室地毯的颜色一般蓝色和烟灰色为主。要求必须耐磨，抗静电，防污性能强，色彩上办公地毯着重于凝重、素雅色调。因此很多人担心办公室的地毯，是否具有抗污、抗菌、耐压、耐磨的功能，是否会有异味等问题。办公室是办公人群的久待之地，如果办公室地毯选择不当，可能会影响办公人士的身心健康或者引发一些不必要的问题。',
  '2.尼龙地毯本身质地较好，较为密实，不易让其它颜色渗入。尼龙具有很好的耐磨抗强压的性能，飞机的升降轮胎也是尼龙材料做成，而非橡胶。',
  '3.PVC底办公地毯是目前国内使用最广泛的地毯，PVC地毯是指在地毯底背上涂抹聚氯乙烯的混合物，耐老化、色泽比较鲜艳、耐腐蚀、防滑性能比较好，柔软且富有弹性，不过一旦燃烧可能会催发出些许有害烟气，所以需要避免火灾，因为无论哪种地毯都有化学成分，都需避免火灾。',
  '4.选择尼龙地毯式要选液态染地毯，不要选择表面着色的尼龙地毯。液态尼龙地毯是尼龙丝的颜色内外一致，磨损表面，里面的颜色都不会变，保持历久弥新的效果。表面着色的尼龙地毯只是表面涂抹一层颜色，而内部还是尼龙白纱，磨损了表面颜色以后，里面的白色会显现出来，白色易吸收其它颜色，这样会使人流大的地方与人流小的地方出现明显色差。',
  '5.　日常维护：使用办公地毯需要注意及时定点、定期清洁，保证地毯卫生;选择地毯颜色时，尽量避免大面积浅色或过于鲜艳色彩铺设，一方面不适合办公场所氛围，另一方面浅色对日后保养较为费神，尽量选择不易显脏的地毯以及尽量不要选择纯色地毯，纯色地毯有一点脏便很容易察觉，而且纯色地毯的接缝会因为地面不平整而容易看出。可以选择条纹或带有小碎植物花卉的地毯;可以在门口处放置一块除尘垫，减少外来灰尘进入到办公室。'
],
  imgUrl: [require('../assets/article/article-4-1.jpg'), require('../assets/article/article-4-2.jpg')]
}, {
  title: '家庭装修中水电隐蔽工程包括的项目',
  descr: ['1、水电施工说白了就是水施工和电施工，这是开始装修的第一步，也是重要的一步，那么，水施工包括哪些项目呢?自己想想，其实就是铺设水管路，做好厨房和卫生间的防水，而电施工呢，包括地、墙、顶面的开槽、埋线、穿线和封槽，另外就是开关、插座、灯具的安装。',
  '2、前期准备:水电隐蔽工程最忌讳的是重新覆盖和掩盖，这样相当于直接返工，因此，前期的准备一定要做好，承包项目一定要权责明晰，保障双方利益。其中包括.主要材料的质量，如电器电料是否包装完整;电线保护管是否有破损;开关插座是否配套;确定施工位置，施工后不要再改造或添加;最为重要的就是以房屋水电设施的施工量做成合理报价，签订明细合同。',
  '3、开槽、埋线、穿线、封槽:出于美观的考虑，电线最好不要外露，根据线路走向和接线盒位置的标注，在地面、墙面、顶面凿线槽和线盒的埋槽，然后埋装接线盒和线管。接着逐步整理线管，使线管平稳贴在槽底，最后用水泥砂浆封埋管槽和线盒厂的空隙，填平。需要注意的是，要以水平线为标准定位放线，挖线盒，按照管径大小开槽。无论是电源线、电话线还是网线、门禁线，电视线，都要固定好开槽的位置。等砂浆凝固后，将线盒内多余线管截去，管口伸出盒内壁3mm即可。',
  '4、安装插座和开关:线路布置完成之后，在每个线盒#头处安装开关面板和各种插座以及灯具。保证开关、插座的安装与墙面高低致，面板端庄、牢固。保证同一个场所，开关上合开灯，下分关灯。需要注意的是，低插座的安装要高出地面0.5m，高插座要高出地面1.5m，落地插座一定要有盖板，潮湿的地方使用防溅型插座。开关的安置最好与门框相距赚0.2m，相邻的两个开关相隔要大于0.2m，同一场所高低差不要太大',
  '5、铺设水管路:水管路一般不需要花费太大的工夫，最好不要随便改动，按照房屋原来的设置。需要做的就是确定水管道铺砖的厚度，并固定好。对一些需要人工改动的地方，精密计算，使用牢固的PPR水管接口，保障与小电设施的对接。',
  '6、防水工程:一般情况下卫生间、厨房地面都有防水层，只要不破坏原来的防水层，就不会渗漏，但是如果装修中增添设备或者重新布局上下水管，就需要重做防才施工。要先将地面凿平，然后用防水涂料刷3遍。承重墙要做03m的防水处理，非承重墙要做18m的防水处理。墙壁内的水槽也要涂防水涂料，以防漏水。',
  '7、验收:在各项工程完成之后，验收也是一项大工程。包括上下水是否顺畅，线路有没有交叉，开关插座面板安装是否整齐一致，是否通电等等，都需要—验收。水电隐蔽工程是一项技术含量较高的工程，一定要请专业人员来施工，在施工之前，最好能够清楚了解施工的目的和达成的效果，避免些可能出现的纠纷。'
  ],
  imgUrl: [require('../assets/article/article-5.jpg')]
}, {
  title: '办公楼办公室装修风水布局大全',
  descr: ['1.办公室装修根据办公室的使用者身份地位不同而不同，而老板的办公室装修无疑是最重要的。办公室装修风水在老板办公室中也是不可忽略的。今天融发装饰就为大家讲讲关于办公室装修风水布局的小知识。',
  '2.外部环境 老板是企业的决策者，所以他的办公室装修一定要符合财运的风水布局，要避免办公室的正前方有电杆、变压器、建筑物尖角迎门等，因为这会犯冲煞，对公司的员工不利，影响办公效率。',
  '3.公共区域 办公室宜宽大辽阔;从静宫八卦的角度而言，办公室正前方的明堂位，正属于离位，离卦在八卦中乃事业的象征。因此明堂，亦即办公室正前方的位置，可说直接指涉这个单位的前程吉凶。所以如果办公室的明堂狭窄闭塞，势必象征此单位前途有限，阻碍众多，开发艰难。后之，如果办公室的内外明堂均开阔清幽，则意指这家公司或这个单位，前途似锦，顺利而成功。',
  '4.内部环境 老板相当于一家之主，他的办公室风水好坏直接影响到整个企业的兴衰，所以，老板的办公室装修风水显得尤为重要。老板的办公室最好是一个套间，外间设文员一位。外间要小，占整个办公室面积的三分之一，而内间老板室应占三分之二。外间置等候位，以聚人气。内外间中间墙的门不要设在中央部位，而应设在整体办公室入门处的近侧。防止老板室内财气的直泄，形成“曲则有情”的风水格局。',
  '5.办公室布局风水要注意的细节 (1)忌座位冲着大门 办公室风水座位不能直冲大门。(2)办公室风水座位后面宜有靠(墙或柜)，不能背着门或走道。(3)办公室风水座位前方不能紧贴墙壁(缓冲区不够)。(4)办公室风水座位前方最好不要有人。(5)办公室风水座位不能正 对着厕所门。(6) 办公室风水座位不能在复印机或计算机的后方。(7)办公室风水座位旁不能有洗手台或水龙头。(8) 办公室风水座位旁不能有大垃圾桶或杂物。(9) 办公室风水座位上不能光线不足或没有窗户。(10)办公室风水不能正对着厨房或瓦斯炉、冰箱。(11)办公室风水座位不能正对着饮水机。(12) 办公室风水座位不能正对着主管或老板房间门。(13)办公室风水座位正上方不能有大梁或吊灯。(14) 办公室风水座位不能被大型电器或电器(计算机、复印机、传真机和寒气机)围住。(15)办公室风水座位正前方不能当作主动线 以上这十几点都是我是办公室布局风水要注意的，这边建议你，因此对于个人的家居房屋的风水布置还需要咨询资深大师来根据每一个人的八字命理相结合，那么办公室布局风水也一样的，这样才可以最后得出最好的风水布置方案。'
],
  imgUrl: [require('../assets/article/article-6-1.jpg')]
}, {
  title: '简约欧式 别墅装修风格',
  descr: ['1.此案的设计从刚开始的自然清新，绿色，到后来的简约欧式，经过了好长时间的设计探讨。地下室一直是没有大的设计变化，业主主要就是要求作为运动和 一层是业主主要要打造的空间，既大气又内敛，不张扬中透着设计，简约中透着别墅的高贵品质。一楼的垭口几乎都设计成了圆拱型，透着一点点托斯卡纳风，米色的墙面和黄色的仿古地砖，非常温馨，业主夫妇都是高级知识分子，家里的藏书非常丰富，无论是组合的电视柜还是休闲厅都用书柜来打造墙面，既节约造型的费用，又收纳了书籍，一举两得。',
  '2.　休闲的空间，同时也有设备房，保姆房、卫生间、车库等，业主比较喜欢乒乓球，所以摆放一台乒乓球案是必备的选择，顶部有些管道，故围绕管道做成流线型的造型吊顶，既美观又互相呼应。',
  '3.餐厅配饰上主要靠绿植和西洋油画以及打造，高矮参差的绿植，油画的浓浓色彩，仿佛把人带到了遥远的国度',
  '4.三楼是女主人的主要活动区，独立透天玻璃顶的书房，可以看看书，练练字，晚上还可以抬头，看看天空的夜色，真有一种世外桃源的感觉。',
  '5.主卧室宽敞挑高，宽大的落地窗，顶部的造型和结构比较复杂，除了把中央空调的进出风口留好外，在造型上可以顺势而为，不用做过多的设计，让整个房间就非常大气，雍容华贵，是颐养天年的最佳所在。',
  '6.天蓝色系的墙面上排列组合了许多形状各异的相框和装饰画，跳跃的颜色让这间儿童房的背景墙显得活力四射，柠檬黄色的儿童床在墙面颜色的衬托下让整间儿童房都显出明朗的氛围。',
  '7.二楼主要是男主人的活动场所，主卧和书房打造成了套间的结构，由于是新搭的楼板担心承重，所以没有在书房内放太多的书柜，博古架作为卧室和书房的过度，整个房间书香气十足。',
  '8.橙白相间的波浪地毯、色彩浓烈的世界地图墙纸、原木色的儿童床和深色抱枕，无一不是在增添儿童所需所爱的童趣，同时也让亮色去提亮空间，避免空间的暗沉。',
  '9.除了明亮的颜色以外，一款非常有创意的鸟笼吊灯点亮了整个空间，给孩子无限遐想。',
  '10.背景墙和被褥丰富的颜色大大地刺激了视觉感官，色彩的跳跃感和层次感有效地活跃了空间氛围，炫酷的感觉大儿童也会喜欢吧!'
  ],
  imgUrl: [require('../assets/article/article-7-1.jpg'), require('../assets/article/article-7-2.jpg'), require('../assets/article/article-7-3.jpg'), require('../assets/article/article-7-4.jpg'), require('../assets/article/article-7-5.jpg'), require('../assets/article/article-7-6.jpg')]
}, {
  title: '农村房屋风水学大解剖',
  descr: ['1.风水学是流传了几千年历史，至今也在延续，住宅风水的好坏在不同的程度上会影响到人们的日常生活，所以农村房屋风水学入门我们必要了解的，才能打造好的农村房屋风水，房屋有不要户型不正、西北缺角客厅封闭以及没有明堂等。大家都知道农村住宅风水学有很长的一段历史，在农村住宅风水学被认为是关系到全家的财运、事业及家庭和睦的关键，接下来就为你介绍一下农村房屋风水。',
  '2.　户型不正，奇形异状就容易招来横祸。因此，居家的房子不管面积是大还是小，户型一定要方正。风水中最忌的是三角型房子、梯型的房子或者是其它不规则形状的户型。奇形异状的房子不能买，那缺角的房子可以买吗?由于现在开发商十分追求利益最大化，所以每一层都会尽可能多的增加户数，这也导致了现在的房屋缺角很普遍，而且方正户型比较少，不可避免的就会遇到缺角房子。客厅就是室内的小明堂，平时家人在一起聚会或者是来外人时招待客人的地方。因为卧室的面积都比较小的，而且家里人的卧室都是分开的。大人是大人的，孩子是孩子的，聚在一起家里人聊聊天很不方便。因此，客厅要选开放式的。一般而言，客厅很少有封闭的。不过，还真有开发商把客厅设计成半封闭的。风水中讲一定要有明堂，明堂的大小代表事业的大小。在房屋上面，明堂就是指房子前面的宽敞程度。现在这个寸金寸土的都市社会，楼越盖越高，间距越来越小，人们就像蜗居在笼子的鸟，无比的郁闷啊。',
  '3.住宅的西北方有大树属于大吉，此位有大树可保护此住户的人，会带来全家幸福的，若不知这一点把大树砍掉，可能会有绝子绝孙的大祸，朋友们不可不注意农村住宅门前绝对不可有枯树，即便不是大树也不管是直立的还是倒在地上的，在风水上是损及老人的，而切还有引导贫贱的力量，最好连根拔掉。在村里的住宅最好不要比周围的建筑高，要不然会钱财不保的，从现实来说，这样的住宅也有好多危险的，如遭火灾，风灾，空袭等都首当其冲，也没有遮档阳光的条件，阳盛阴衰，阴阳不调等都会影响家人的健康。'
  ],
  imgUrl: [require('../assets/article/article-8-1.jpg'), require('../assets/article/article-8-2.jpg')]
}, {
  title: '接地气的现代风水学介绍',
  descr: ['风水用于趋吉避凶，家居现代风水学讲的就是利用环境创造舒适的生活空间，利用风水来改变环境，从而达到好的居住条件，现在我们用风水讲求的就是一个舒适，一个心安，现在风水学要遵循天地人合一原则、五行相生相克原则、因地制宜原则以及整体系统原则等等。要想有好的运势，家居风水是十分重要的，现代风水学也是有很多讲究的，接下来就为你介绍一下现代风水学原则。',
  [{
    title: '现代风水学介绍',
    descr: '现在风水学理论是集地理学、星象学、景观学、建筑学、生态学和人体生命学等多种学科于一体的古代建筑规划设计理论。经过这么多年的发展，风水越来越多的现象都能够用科学来解释，我们对现代风水的看法也开始改变，它已经慢慢开始从封建迷信那个行列中脱离。现代风水学，不是讲封建迷信的风水，而是传统风水学的去伪存真，它与营造学、造园学共同组成了中国古代建筑理论的三大支柱，其宗旨是周密考察了解自然环境，顺应自然，有节制地利用和改造自然，利用环境做改变，以创造良好的居住与生存环境为目的，赢得最佳的天时地利与人和，达到天人合一的至善境界。'
  },
  { title: '现代风水学原则天地人合一原则',
    descr: '天文学、地理学和人体科学是中国风水学的三大科学支柱。天、地、人合一是中国风水学的最高原则。这其实与中国的创世神话“盘古开天劈地”有关，本来天地混，盘古手持巨斧，将天地分为两半，两股气逐渐分开，阳清之气上升为天，阴浊之气下降为地。天和地每天都在变化中，而人则处在天地之间。'
  }, {
    title: '五行相生相克原则',
    descr: '五行是中国古代的一种物质观，五行具体是指：金、木、水、火、土。中国古人认为大自然由五种要素所构成，随着这五个要素的盛衰，而使得大自然产生变化，不但影响到人的命运，同时也使宇宙万物循环不已。'
  }, {
    title: '因地制宜原则',
    descr: '地理位置不同，住宅也就有了差异。中国风水学对于住宅所处环境不同，又有所谓井邑之宅、旷野之宅、山谷之宅等区分，因此，在风水学应用上，又各有所侧重。对于旷野之宅和山谷之宅，因其与周围自然地理环境关系密切，多注重形法;而井邑之宅，则因其外部环境的限制，常以形法、理法并举。'
  }, {
    title: '整体系统原则',
    descr: '整体系统论，作为一门完整的科学，它是在本世纪产生的;作为一种朴素的方法，中国的先哲很早就开始运用了。风水理论思想把环境作为一个整体系统，这个系统以人为中心，包括天地万物。环境中的每一个子系统都是相互联系、相互制约、相互依存、相互对立、相互转化的要素。风水学的功能就是要宏观地把握协调各系统之间的关系优化结构，寻求最佳组合。'
  }, {
    title: '依山傍水原则',
    descr: '依山傍水是风水学最基本的原则之一。山体是大地的骨架，水域是万物生机之源泉，没有水，人就不能生存。考古发现的原始部落几乎都在河边台地，这与当时的狩猎和捕捞、采摘经济相适应。坐北朝南原则朝南的房屋便于采取阳光。阳光对人的好处很多：一是可以取暖，冬季时，南方比北方的温度高l至2度;二是参与人体维生素D的合成，小儿常晒太阳可予防佝楼病;三是阳光中的紫外线具有杀菌作用，尤其对经呼吸道传播的疾病有较强的灭菌作用;四是可以增强人体免疫功能。'
  }
    ]
  ],
  imgUrl: [require('../assets/article/article-9.jpg')]
}, {
  title: '书房装修创造舒适环境重要素',
  descr: [
    '1.书房如何布置才能更舒适，即使这里是工作的地方，但也是令人愉快的地方,书房装修打造舒适环境掌握几个要素?',
    '2.要充分利用书桌上方和下方的地带，将辅助设备安放在这里，给书桌留出更大的空间。',
    '3.在书房里要合理地安排空间，通常会出现三个区域：在工作区，所有常用的东西都要保证很方便地拿到。在辅助区，可以安排那些不常用的设备，比如，传真机或打印机。而在休闲区，可以安排一些娱乐项目，或者根据需要做成一个会客环境，并通过一些放松的活动来调节你的工作节奏，比如弹钢琴、浇花。总之，书房应该是个舒适的空间，即使是工作，也是一个令人愉快的地方',
    '4.书房和办公室不同，因为书房有辅助区来完成大量的储藏功能，所以家庭办公的书桌可以尽量甩开办公室的影子，不必遵行所谓的标准尺寸，而强调工作台面的舒适。有的人喜欢宽大的台面，则要看房间的面积能否容纳;有的人喜欢装饰性强的书桌，则要看风格能否融入环境;有的人喜欢多功能书桌，则要考虑书桌周边的功能配合。而购买书桌时，我们也要考虑椅子的尺寸和风格，因为，椅子对于书桌，就像茶几对于沙发，都可以自行搭配,首先把常用和不常用的书分开，这样哪些书束之高阁，哪些占据存取的最佳位置就比较清晰了。',
    '5.需要管理的书架往往是因为有较多的藏书，而管理的目的是为存取方便。首先把常用和不常用的书分开，这样哪些书束之高阁，哪些占据存取的最佳位置就比较清晰了。然后再细分书的种类，同类书籍安放在同一格子内，方便查找，你甚至可以在书架上加标签。如果你是一个特别爱书的人，还可以建立书籍档案，每本的购买时间、主要内容、存放位置、借出归还状况等，毕竟大脑的记忆是有限的，简单的档案可以在关键时刻帮忙。如果你的书房不是摆设而真的是用来工作或学习的地方，那么，良好的自然光不但满足照明需求，也能带给你好心情。',
    '6.当书房不是一个专门的房间时，书房会被安排在一些特殊的空间，甚至开辟出来和其他功能并用。比如，阁楼作为书房很僻静，甚至可以作为一个很自我的区域，连卧室的功能也含在其中。或者有些人把阳台的空间封起来做一个小书房，不但自然光充足，而且便于休息远眺。还有的人把书房和影音室结合起来，看电影听音乐和工作各自撑起了半边天。所以书房的空间也是个性的空间，不必太拘泥规则。如果是朝南的房间，光线会比较强烈，我们要么用窗帘调节，要么把工作区侧放或靠后',
    '7.为了直接利用自然光源，我们可以把工作区安排在窗前，如果是朝南的房间，光线会比较强烈，我们要么用窗帘调节，要么把工作区侧放或靠后。但是我们应该考虑到电脑屏幕的反光问题，而把位置安排在窗户两侧，离窗稍远的墙边。不过对于远离窗口的空间，由于光线比较暗淡了，我们最好用来安排辅助区的活动。'
  ],
  imgUrl: [require('../assets/article/article-10.jpg')]
}]
import { mapActions } from 'vuex'
function getArticleLeft (id) {
  let currentArticle = articleStorage[id]
  let imgUrlLength = currentArticle.imgUrl.length
  let descrLength = currentArticle.descr.length
  let array = []
  for (let i = 0; i < descrLength - imgUrlLength; i++) {
    let currentDescr = currentArticle.descr[imgUrlLength + i]
    let arrTemp = []
    if (typeof currentDescr === 'object') {
      arrTemp = currentDescr.reduce((a, b) => {
        return a.concat(b.descr)
      }, [])
    } else {
      arrTemp = currentDescr
    }
    array.push(arrTemp)
  }
  return array
}
export default {
  data () {
    let id = this.$route.params.id
    return {
      article: articleStorage[id],
      articlLeft: getArticleLeft(id)
    }
  },
  mounted () {
    const that = this
    that.updateRoutePath('/Article')
  },
  methods: {
    ...mapActions([
      'updateRoutePath'
    ])
  }
  // route: {
  //   data: function (transition) {
  //     let articleId = transition.to.params.articleId
  //     return {
  //       article: article[articleId],
  //       // articleId: articleId,
  //       articlLeft: getArticleLeft(articleId)
  //     }
  //   }
  // }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang='less' scoped>
  .fl{
    float: left;
  }
  .fr{
    float: right;
  }
  .banner{
    width: 100%;
    margin: 0 auto;
    position: relative;
    .title{
      position: absolute;
      bottom:0;
      left: 21%;
      color:#fff;
      font-size: 35px;
    }
    img{
      width: 100%;
    }
  }
  .article-list{
    overflow: hidden;
    width: 1200px;
    margin: 0 auto;
    margin-bottom: 100px;
    .article-name{
      font-size: 18px;
      letter-spacing: 3px;
      font-weight: bold;
      width: 100%;
      border:1px solid #eee;
      padding: 25px;
    }
    .article-img{
      margin: 0 auto;
      width: 1000px;
      min-height: 200px;
      overflow: hidden;
      border:1px solid #eee;
      padding: 10px;
      margin-bottom: 25px;
      position: relative;
      .img-wrap{
        width: 100%;
        text-align: center;
        img{
          width: 500px;
          height: 450px;
          border:1px solid #eee;
          margin: 0 auto;
          &[lazy=loaded] {
            -webkit-animation-duration: 1s;
            animation-duration: 1s;
            -webkit-animation-fill-mode: both;
            animation-fill-mode: both;
            -webkit-animation-name: fadeIn;
            animation-name: fadeIn;
          }
          &[lazy=loading] {
            position: absolute;
            width: 40px;
            height: 40px;
            z-index: 1;
            left: -20px;
            bottom: 25%;
            margin-left: 50%;
          }
        }
      }
      p{
        margin: 20px 0;
        padding: 5px;
        text-align: left;
      }
    }
    li{
      width: 100%;
      overflow: hidden;
      margin: 25px 0;
      .descr{
        padding-top: 10px;
        text-align: left;
        width:900px;
        line-height: 25px;
        span{
          font-size: 16px;
          color:#666;
          font-weight: bold;
          &.type{
            margin-right: 10px;
          }

        }
        .title{
          font-weight: bold;
          font-size: 16px;
          cursor: pointer;
        }
      }
    }
  }
</style>
